class 1_001Relocation{
	public static void main(String[]args){
	
	}
}
/*
Составляем приблизительный список вещей:
1) Одежда
2)Бытовая техника
3)Мебель
4)Кухонная утварь
5)Быт.химия и косметика
6)Мелочи(игрушки, плакаты,статуэтки)
7)Документы
8)Книги и журналы
9)Обувь
10)Еда(крупы, приправы, банки с соленьем и т.п.)

Делим список на:
1)Тяжелые вещи(более 5 кг)
2)Легкие вещи
3)Отложенные вещи(минимум вещей на последок - зубная щетка, чашка, одежда в которой уезжать)


После того как списки сформированны готовим нужное к-во сумок под вещи.
Начинаем собирать вещи.
Сначала собираем вещи из группы "тяжелых". После того как уложили тяжелые вещи проходимся по крвартире еще раз.
Если найдена вещь из тяжелых - добавляем к остальным. Если ничего не найдено - считаем этот пункт завершенным.
То же самое делаем с вещами из списка "легких".
В конце формируем последнюю группу вещей группы "отложенные".

После того как все вещи гарантированно сложены:
Проверить деньги (наличные и карточку);
Позвонить в грузоперевозку, узнать цены на перевоз вещей.
Если названная сумма есть на руках - вызываем грузовик и ждем.
Если названная сумма больше той что есть на руках - идем снимать деньги с карточки.
Как только деньги сняты - вызвать грузовик и ждать.

Выстраиваем сумки с вещами: сначала те, что превышают 5 кг и так далее по уменьшению веса.
Последним забираем поклажку с собранными "отложенными вещами"
Приезжает грузовик, забираем вещи, едим на новое место жительства.

Если работник понравился -  сумма + чаевые свыше 40%
Если не понравился  - сумма+чаевые около 5-10%
Если хамил, грубил, ронял вещи - сумма или же только сумма + жалоба начальству.













*/