//метод возвращающий позицию самого большого числа в строке массива
class ArrayMethod{
	public static void main (String[]args){
		
		int []myArr = {1, 5, 4, 3};
		
	}

	public static int returnPositionOfMaxValue(int [] inArray){
		//кладем в переменную inArray[0];(значение элемента массива)
		//кладем в переменную 0; (позиция элемента массива)
		
		//пилим цикл
			//если значение переменной меньше текущего значения элемента в массиве
				//то ищем кладем в переменную текущее значение
				// кладем  в 2-ю переменную позицию текущего хначения
		
		//возвращаем переменную с позицией ячейки
	
	
	}
	
	
	
	
	
	
	
	
	
	
	
}