// Отсортировать массив по возрастанию/метод пузырька.
class BubbleSort{
	public static void main(String[]args){
		
		int []myArr = {11,5,4,3,8,1,9};
		
		/*
		сортировка массива пузырьком подразумевает то, что значения массива должны выстроится по возрастанию
		где бы ни были (в пределах массива).
		это значит, что:
		пример:
		начинаем с 0
		0=11, 1=5, 2=4, 3=3, 4=8, 5=1, 6=9
		должна быть "точка отталкивания"
		11 будет сравниваться с 5
		больше ли 5 чем 11?
		нет, значит 5 переходит на позицию 0 а 11 на позицию 1
		
		4 будет сравниваться с 3
		больше ли 3 чем 4
		нет, 3 переходит на позицию 2 а 4 на позицию 3
		
		8 будет сравниваться с 1
		1 больше чем 8?
		нет, 1 перемещается на позицию 4 а 8 на позицию 5
		
		несостыковочка
		с чем будет сравниваться значение без пары?
		
		
		
		*/
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}
}