//Создайте массив целых чисел, заполните его только четными числами, а затем каждый второй элемент умножьте на предыдущий. 
class MultiplyNum {
	public static void main (String []args){
		
		/*
		массив из целых чисел
		int [] myArr = new int [10];
		заполниить его только четными числами
		int [] myArr = {0,2,4,6,8,10};
		каждый второй элемент (если 1-е значение - 0, то работаем с 2 и т.д.) - {0,_,2,_,4,_,6,_,8,_,10};
		умножьте на предыдущий:
		(2*0, 4*2,6*4, 8*6, 10*8)
		
		пример:
	заполняем массив четными числами, выводим:
		int [] myArr = {0,2,4,6,8,10};
	 теперь нам нужно каждый 2-й элемент умножить на предыдущий: 2*0 = 0
	 сумму ложим в текущий элемент, то есть вместо 2 будет 0
	 массив выглядит так:
		{0,0,4,6,8,10};
	дальше у нас идет 4
		4*0 = 0
	массив наш:
		{0,0,0,6,8,10};
	но если так пойдкт дальше, то массив в итоге будет состоять только из нулей.
		
		*/
		
		
		
		
		
	}
}