//Написать свой аналог метода System.arraycopy()
class myArrayCopy{
	public static void main (String []args){
 

// System.arraycopy().

/*
Написать метод который копирует данные из массива.

Мой метод должен принимать изначальный массив как параметр и копировать в другой массив его данные(скопированные из первого)
первый параметр - имя входящего массива;
второй параметр - номер ячейки этого массива с которого начнется копирование;
третий параметр - имя массива в который будут копироваться объекты
четвертый параметр - номер ячейки этого массива в который начнется комирование
пятый параметр - длинна массива

разбираем пример:
нам дан массив 
int []myArray = {1,5,7,12,3,90};
создаем еще один массив  длинной 3
int []myArray2 = new int [6];
нужно скопировать из первого во второй массив все данные начиная с нулевой ячейки
и до конца длинны массива.
 
даем задание программе: 
цикл
пока не закончится длинна массива
берем массив с именем myArray, начиная с нулевой ячейки и заносим данные в ячейки myArray2:
myArray[0] = myArray2[0];//значение 0-й ячейки массива myArray2 равно значению 0-й ячейки массива myArray
myArray[1] = myArray2[1];//значение 1-й ячейки массива myArray2 равно значению 2-й ячейки массива myArray
myArray[2] = myArray2[2];//значение 2-й ячейки массива myArray2 равно значению 3-й ячейки массива myArray
myArray[3] = myArray2[3];//значение 3-й ячейки массива myArray2 равно значению 4-й ячейки массива myArray
myArray[0] = myArray2[0];//значение 4-й ячейки массива myArray2 равно значению 5-й ячейки массива myArray
myArray[0] = myArray2[0];//значение 5-й ячейки массива myArray2 равно значению 6-й ячейки массива myArray





*/

	}

  
  
  
  
  
 }