//Найдите сумму элементов массива, которые находятся между двумя нулями. Если двух нулей в массиве нет - вывести 0
class NullArray{
	public static void maon (String[]args){
		
		int [] myArr = new int {6,0,5,5,10,0,1};
		
		/*
		// целочисленная переменная номер 1 (хранит позицию в которой первый 0)
		//целочисленная переменная номер 2 (хранит позицию в которой второй 0)
		
		//пилим цикл {
			// если текущий элемент массива = 0{
			//то кладем его в переменную(фиксируем 1-й ноль)
			}
			//если текущий элемент массива = 0 {
			//то кладем его во вторую переменную(фиксируем 2-й ноль)
			}
		}		
		Вывод:("Первй ноль на позиции "+ целочисленная переменная номер 1 + "Второй ноль на позиции - "+ целочисленная переменная номер 2 );
		*/
		
	}
}