//Найдите сумму элементов массива, которые находятся между двумя нулями. Если двух нулей в массиве нет - вывести 0
class NullArray{
	public static void maon (String[]args){
		
		int [] myArr = new int {6,0,5,5,10,0,1};
		
		/*
		// целочисленная переменная номер 1
		//целочисленная переменная номер 2
		
		//пилим цикл {
			// если текущий элемент массива = 0{
			//то кладем его в переменную(фиксируем 1-й ноль)
			}
			//если текущий элемент массива = 0 {
			//то кладем его во вторую переменную(фиксируем 2-й ноль)
			}
		}		
		
		*/
		
		
	}
}