//Создайте массив из всех нечётных чисел от 1 до 99, выведите его на экран в строку, 
//а затем этот же массив выведите на экран тоже в строку, но в обратном порядке (99 97 95 93 … 7 5 3 1)
class OrderOfArrNums{
	public static void main(String[]args){
		
		int [] myArr = new int [49];
		
		for(int i = 1;i<=99;i+=2){
		
		System.out.print(myArr[i] + " ");
		}
		
		

		
		
		
		
		
	}
}