//Проверить, отсортирован ли массив в обратном порядке.
class ReverseArr{
	public static void main(String []args){
		
		
		/*
		метод пузырька, только выводить не по возрастанию, а по убыванию.
		и установить проверку на вопрос отсортирован ли массив как указанно в задаче.
		
		 то есть должен выводиться не масси а сообщение о том отсортирован ли он или нет.
		 
		 нет, это не пузырек, смысл задачи другой.
		 если дан массив выстроен в обратном порядке - да, массив отсортирован
		 если дается массив с разбросанными значениями - нет, не сортирован
		*/
		
		
		
	}
} 