//Проверить, отсортирован ли массив в обратном порядке.
class ReverseArr{
	public static void main(String []args){
		
		//два разных массива для проверки
		int []mySortArr = new int {1,2,3,4,5,6};
		int []myReverseSortArr = new int {6,5,4,3,2,1}
		/*
		приблизительный способ решения:
		если каждое последующее число меньше предыдущего - отсортирован
		
		 если дан массив который выстроен в обратном порядке - да, массив отсортирован
		 если дается массив выстроенный по возрастанию значениями - нет, не сортирован
		*/
		
		
		
	}
} 