//Проверить, отсортирован ли массив в обратном порядке.
class ReverseArr{
	public static void main(String []args){
		
		//два разных массива для проверки
		int []mySortArr = {2,1,3,4,5,6};
		//int []myReverseSortArr = {6,5,4,3,2,1};

		/*
		
		/пилим цикл
		Условие 1
		//если каждое последующее число массива меньше предыдущего  -
			if (mySortArr[i+1]<=mySortArr[i]){
			//массив считаем отсортированным
		
		Условие 2
		if (mySortArr[i+1]>mySortArr[i]){
			//если в массиве будет хотя бы один раз так, что  последующее  число окажется больше предыдущего -
			//массив считаем неотсортированным.
			
			//если натыкаемся на условие 2 - 
			выход из цикла
			вывод - массив не отсортирован
			
			
			
			
			
			
			
			
			
		
		*/
		
		
		
} 